АлогистикТест2/src/InformationRegisters/алк_СостояниеСушильныхКамер/алк_СостояниеСушильныхКамер.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>алк_СостояниеСушильныхКамер</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Неисправна</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>СушильнаяКамера</name>
    <type>
      <types>CatalogRef.алк_Штабели</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

АлогистикТест2/src/InformationRegisters/алк_СостояниеСушильныхКамер/ManagerModule.bsl
Процедура ДобавитьЗапись(Период,СушКамера,Неисправна) Экспорт  
	Запись = РегистрыСведений.алк_СостояниеСушильныхКамер.СоздатьМенеджерЗаписи();
	Запись.Период = Период;
	Запись.СушильнаяКамера = СушКамера;
	Запись.Неисправна = Неисправна;
	Запись.Записать();
КонецПроцедуры
